{
  "therapeutic_responses": [
    "ADHD brains feel emotions more intensely - what yo...",
    "Your ADHD brain is working extra hard right now. Y...",
    "Emotional overwhelm with ADHD is exhausting. You'r...",
    "ADHD makes everything feel more urgent and intense...",
    "Your ADHD brain processes things differently, and ...",
    "Executive dysfunction is real with ADHD. It's not ...",
    "ADHD hyperfocus can be both a gift and a challenge...",
    "Rejection sensitivity with ADHD can make criticism...",
    "ADHD time blindness makes planning hard. Let's bre...",
    "Your ADHD brain needs more dopamine to feel motiva...",
    "Emotional dysregulation with ADHD means big feelin...",
    "ADHD working memory challenges make following inst...",
    "Your ADHD brain thrives on novelty and stimulation...",
    "Masking ADHD symptoms is exhausting. You deserve u...",
    "ADHD paralysis when overwhelmed is real. Let's fin..."
  ],
  "intervention_library": [
    "Let's start with just one deep breath. In through ...",
    "Right now, name 5 things you can see, 4 things you...",
    "Your safety is the most important thing right now....",
    "This intense feeling will pass. ADHD emotions are ...",
    "Let's use the TIPP technique: splash cold water on...",
    "Try the STOP technique: Stop what you're doing, Ta...",
    "Use bilateral stimulation: tap your knees alternat...",
    "Ground yourself: press your feet firmly into the f...",
    "Name your emotions: 'I'm feeling overwhelming anxi...",
    "Use the 4-7-8 breath: breathe in for 4, hold for 7...",
    "Try progressive muscle relaxation: tense your shou...",
    "Use the RAIN technique: Recognize what's happening...",
    "Practice radical acceptance: 'This is what I'm fee...",
    "Use your senses: hold an ice cube, smell something...",
    "Create safety: remind yourself where you are, that..."
  ],
  "user_patterns": [
    "User shows attention fade pattern: short responses...",
    "User exhibits ADHD emotional dysregulation: intens...",
    "User demonstrates hyperfocus tendency: very long m...",
    "User shows executive dysfunction: difficulty with ...",
    "User displays rejection sensitivity: takes feedbac...",
    "User exhibits time blindness: underestimates task ...",
    "User shows working memory challenges: loses track ...",
    "User demonstrates perfectionism paralysis: afraid ...",
    "User exhibits emotional overwhelm: big feelings ab...",
    "User shows masking exhaustion: appears fine but st...",
    "User demonstrates dopamine-seeking: difficulty wit...",
    "User exhibits social anxiety: fears judgment about...",
    "User shows cognitive overload: too many thoughts a...",
    "User demonstrates imposter syndrome: feels like fr...",
    "User exhibits crisis escalation: moves quickly fro..."
  ]
}